zxr1158/HeroRobot_HEAD/Board/Port/bsp_can_port_stm32F4.cpp
#include "bsp_can_port.h"

// Board / HAL
#include "can.h"
#include "../Device/debug_tools.h"
#include "stm32f4xx_hal_can.h"
#include "stm32f4xx_hal_uart.h"
#include <string.h>
#include "usart.h"

// 滤波器编号
#define CAN_FILTER(x) ((x) << 3)

// 接收队列
#define CAN_FIFO_0 (0 << 2)
#define CAN_FIFO_1 (1 << 2)

//标准帧或扩展帧
#define CAN_STDID (0 << 1)
#define CAN_EXTID (1 << 1)

// 数据帧或遥控帧
#define CAN_DATA_TYPE (0 << 0)
#define CAN_REMOTE_TYPE (1 << 0)


struct BspCanOpaque {
    CAN_HandleTypeDef* hcan;

    // Multiple subscribers (no heap)
    static constexpr uint8_t kMaxRxCallbacks = 6;
    BspCanRxCallback cbs[kMaxRxCallbacks];
    uint8_t cb_count;
    bool started;
    uint8_t Filter_1;
    uint8_t Filter_2;
};

static BspCanOpaque s_can1{&hcan1, {nullptr}, 0, false,CAN_FILTER(0),CAN_FILTER(1)};
static BspCanOpaque s_can2{&hcan2, {nullptr}, 0, false,CAN_FILTER(14),CAN_FILTER(15)};

static inline BspCanOpaque* to_impl(BspCanHandle h) {
    return reinterpret_cast<BspCanOpaque*>(h);
}

static inline BspCanOpaque* from_hal(CAN_HandleTypeDef* hcan)
{
    if (hcan == &hcan1) return &s_can1;
    if (hcan == &hcan2) return &s_can2;
    return nullptr;
}

BspCanHandle bsp_can_get(BspCanBus bus)
{
    switch (bus)
    {
        case BSP_CAN_BUS1: return reinterpret_cast<BspCanHandle>(&s_can1);
        case BSP_CAN_BUS2: return reinterpret_cast<BspCanHandle>(&s_can2);
        case BSP_CAN_BUS3: return nullptr;
        default:           return nullptr;
    }
}

// static inline uint8_t dlc_to_len(uint32_t dlc)
// {
//     switch (dlc)
//     {
//         case FDCAN_DLC_BYTES_0:  return 0;
//         case FDCAN_DLC_BYTES_1:  return 1;
//         case FDCAN_DLC_BYTES_2:  return 2;
//         case FDCAN_DLC_BYTES_3:  return 3;
//         case FDCAN_DLC_BYTES_4:  return 4;
//         case FDCAN_DLC_BYTES_5:  return 5;
//         case FDCAN_DLC_BYTES_6:  return 6;
//         case FDCAN_DLC_BYTES_7:  return 7;
//         case FDCAN_DLC_BYTES_8:  return 8;
//         case FDCAN_DLC_BYTES_12: return 12;
//         case FDCAN_DLC_BYTES_16: return 16;
//         case FDCAN_DLC_BYTES_20: return 20;
//         case FDCAN_DLC_BYTES_24: return 24;
//         case FDCAN_DLC_BYTES_32: return 32;
//         case FDCAN_DLC_BYTES_48: return 48;
//         case FDCAN_DLC_BYTES_64: return 64;
//         default:
//             // Fallback for any non-standard values
//             return (dlc <= 64) ? static_cast<uint8_t>(dlc) : 8;
//     }
// }

static void dispatch_rx(CAN_HandleTypeDef* hcan, uint32_t fifo)
{
    auto* impl = from_hal(hcan);
    if (!impl || impl->cb_count == 0) return;

    CAN_RxHeaderTypeDef hdr{};
    uint8_t data[64]{};

    if (HAL_CAN_GetRxMessage(hcan, fifo, &hdr, data) != HAL_OK) return;

    BspCanFrame f{};
    f.id = hdr.StdId;
    f.id_type = (hdr.IDE == CAN_ID_STD) ? BSP_CAN_ID_STD : BSP_CAN_ID_EXT;
    f.frame_type = (hdr.RTR == CAN_RTR_DATA) ? BSP_CAN_FRAME_DATA : BSP_CAN_FRAME_REMOTE;
    f.is_fd = false;  // STM32 CAN is not FD
    f.brs = false;    // No BRS in standard CAN
    f.from_fifo1 = (fifo == CAN_RX_FIFO1);//FIFO接口

    f.len = hdr.DLC;//直接赋值
    if (f.len > 0) {
        memcpy(f.data, data, f.len);
    }

    // fan-out
    for (uint8_t i = 0; i < impl->cb_count; ++i) {
        auto cb = impl->cbs[i];
        if (cb) {
            cb(&f);
        }
    }
}

static void ensure_started(BspCanOpaque* impl)
{
    if (!impl || impl->started) return;
    
    // Keep behavior aligned with previous wrapper: start and enable RX interrupts.
//  if(impl->hcan->Instance == CAN1)
//     {
//         can_filter_mask_config(impl->hcan, CAN_FILTER(0)| CAN_FIFO_0 | CAN_STDID | CAN_DATA_TYPE, 0, 0);
//         can_filter_mask_config(impl->hcan, CAN_FILTER(1)| CAN_FIFO_1 | CAN_STDID | CAN_DATA_TYPE, 0, 0);
//     }
//     else if(impl->hcan->Instance == CAN2)
//     {
//         can_filter_mask_config(impl->hcan, CAN_FILTER(14)| CAN_FIFO_0 | CAN_STDID | CAN_DATA_TYPE, 0, 0);
//         can_filter_mask_config(impl->hcan, CAN_FILTER(15)| CAN_FIFO_1 | CAN_STDID | CAN_DATA_TYPE, 0, 0);
//     }
    can_filter_mask_config(impl->hcan, (impl->Filter_1)| CAN_FIFO_0 | CAN_STDID | CAN_DATA_TYPE, 0, 0);
    can_filter_mask_config(impl->hcan, (impl->Filter_2)| CAN_FIFO_1 | CAN_STDID | CAN_DATA_TYPE, 0, 0);




    (void)HAL_CAN_Start(impl->hcan);
    (void)HAL_CAN_ActivateNotification(impl->hcan, CAN_IT_RX_FIFO0_MSG_PENDING);
    (void)HAL_CAN_ActivateNotification(impl->hcan, CAN_IT_RX_FIFO1_MSG_PENDING);
    impl->started = true;
     HAL_UART_Transmit(&huart6,impl->hcan == &hcan1 ? (uint8_t*)&impl->hcan : (uint8_t*)&impl->hcan + sizeof(CAN_HandleTypeDef), 4, HAL_MAX_DELAY);
 
}

// extern "C" void HAL_FDCAN_RxFifo0Callback(CAN_HandleTypeDef* hfdcan, uint32_t RxFifo0ITs)
// {
//     if ((RxFifo0ITs & FDCAN_IT_RX_FIFO0_NEW_MESSAGE) == RESET) return;
//     dispatch_rx(hfdcan, FDCAN_RX_FIFO0);
// }

// extern "C" void HAL_FDCAN_RxFifo1Callback(FDCAN_HandleTypeDef* hfdcan, uint32_t RxFifo1ITs)
// {
//     if ((RxFifo1ITs & FDCAN_IT_RX_FIFO1_NEW_MESSAGE) == RESET) return;
//     dispatch_rx(hfdcan, FDCAN_RX_FIFO1);
// }
extern "C" void HAL_CAN_RxFifo0MsgPendingCallback(CAN_HandleTypeDef *hcan)
{
dispatch_rx(hcan, CAN_RX_FIFO0);
}

/**
 * @brief HAL库CAN接收FIFO1中断
 *
 * @param hcan CAN编号
 */
extern "C" void HAL_CAN_RxFifo1MsgPendingCallback(CAN_HandleTypeDef *hcan)
{
dispatch_rx(hcan, CAN_RX_FIFO1);
}

void bsp_can_init(BspCanHandle h, BspCanRxCallback cb)
{
    auto* impl = to_impl(h);
    if (!impl) return;

    // legacy behavior: overwrite all callbacks
    impl->cb_count = 0;
    if (cb) {
        impl->cbs[0] = cb;
        impl->cb_count = 1;
    }

    ensure_started(impl);
}

bool bsp_can_add_rx_callback(BspCanHandle h, BspCanRxCallback cb)
{
    auto* impl = to_impl(h);
    if (!impl || !cb) return false;

    // reject duplicates (cheap linear scan, list is tiny)
    for (uint8_t i = 0; i < impl->cb_count; ++i) {
        if (impl->cbs[i] == cb) {
            ensure_started(impl);
            return true;
        }
    }

    if (impl->cb_count >= BspCanOpaque::kMaxRxCallbacks) {
        return false;
    }

    impl->cbs[impl->cb_count++] = cb;
    ensure_started(impl);
    return true;
}

bool bsp_can_send(BspCanHandle h, const BspCanFrame* tx)
{
    auto* impl = to_impl(h);
    if (!impl || !tx) return false;
    uint32_t used_mailbox;
    CAN_TxHeaderTypeDef th{};

    th.StdId = tx->id;
    th.ExtId = 0x00;
    th.IDE = (tx->id_type == BSP_CAN_ID_STD) ? CAN_ID_STD : CAN_ID_EXT;
    th.RTR = (tx->frame_type == BSP_CAN_FRAME_DATA) ? CAN_RTR_DATA: CAN_RTR_REMOTE;
  
    th.TransmitGlobalTime = DISABLE;


    // DataLength must be DLC code for FD; legacy code sometimes passed raw length for <=8.
    if (tx->len <= 8) {
         th.DLC = tx->len;
    } 
    // else 
    // {
    //     switch (tx->len) {
    //         case 12: th.DataLength = FDCAN_DLC_BYTES_12; break;
    //         case 16: th.DataLength = FDCAN_DLC_BYTES_16; break;
    //         case 20: th.DataLength = FDCAN_DLC_BYTES_20; break;
    //         case 24: th.DataLength = FDCAN_DLC_BYTES_24; break;
    //         case 32: th.DataLength = FDCAN_DLC_BYTES_32; break;
    //         case 48: th.DataLength = FDCAN_DLC_BYTES_48; break;
    //         case 64: th.DataLength = FDCAN_DLC_BYTES_64; break;
    //         default:
    //             // Unsupported length for FD
    //             return false;
    //     }
    // }

    return HAL_CAN_AddTxMessage(impl->hcan, &th, const_cast<uint8_t*>(tx->data), &used_mailbox);
}



void can_filter_mask_config(CAN_HandleTypeDef *hcan, uint8_t object_para, uint32_t id, uint32_t mask_id)
{
    CAN_FilterTypeDef filter = {0};

    assert_param(hcan != NULL);

    // 解析参数
    uint8_t filter_index = object_para >> 3;                //滤波器索引
    uint8_t fifo_select  = (object_para >> 2) & 0x01;       //FIFO选择
    uint8_t id_type_flag = (object_para >> 1) & 0x01;       //ID类型
    uint8_t frame_type   = object_para & 0x01;              //帧类型


    // 标准ID
    filter.FilterIdHigh = 0x000;
    filter.FilterIdLow = 0x0000;
    filter.FilterMaskIdHigh = 0x000;
    filter.FilterMaskIdLow = 0x0000;

    filter.FilterFIFOAssignment = (fifo_select == 0) ? CAN_FILTER_FIFO0 : CAN_FILTER_FIFO1;
    filter.FilterBank = filter_index;
    filter.FilterMode = CAN_FILTERMODE_IDMASK;
    filter.FilterScale = CAN_FILTERSCALE_32BIT;
    filter.FilterActivation = ENABLE;
    filter.SlaveStartFilterBank = 14;       //CAN2滤波器为14 - 27

    UNUSED(frame_type);                     // 帧类型在FDCAN中不需要配置

    HAL_CAN_ConfigFilter(hcan, &filter);
}
